; domain
(define (domain HARBOR_V04)
  (:requirements :strips :typing)
  (:types block o_block stack crane bottom dock height tape)
  (:predicates (hold ?c - crane ?x - (either block o_block))
  	       (empty_crane ?c - crane)
	       (empty_tape ?t - tape)
	       (block_in_tape ?x - (either block o_block) ?t - tape)
	       (available ?x - o_block)
	       (on ?x - (either o_block block) ?y - (either o_block block bottom) )
	       (top ?x - (either block bottom o_block))
	       (at ?x - (either block bottom o_block) ?s - stack)
	       (at_dock ?x - (either block o_block bottom) ?d - dock)
	       (handle ?c - crane ?s - (either stack tape))
	       (max_height ?h - height)
	       (height ?s - stack ?h - height)
	       (next_h ?a ?b - height)
	       (prev_h ?a ?b - height)
  )
  (:action pick-from-stack-bb
    :parameters (?x - block ?y - (either block bottom) ?s - stack ?c - crane ?d - dock ?ch - height ?nh - height)
    :precondition (and (empty_crane ?c)
                       (handle ?c ?s)
		       (at ?x ?s)
		       (top ?x)
		       (on ?x ?y)
		       (at_dock ?x ?d)
		       (height ?s ?ch)
		       (prev_h ?nh ?ch))
    :effect (and (not (empty_crane ?c))
                 (hold ?c ?x)
		 (not (on ?x ?y))
		 (not (at ?x ?s))
		 (not (top ?x))
		 (top ?y)
		 (not (at_dock ?x ?d))
		 (not (height ?s ?ch))
		 (height ?s ?nh))
  )

  (:action pick-from-stack-oo
    :parameters (?x - o_block ?y - o_block ?s - stack ?c - crane ?d - dock ?ch - height ?nh - height)
    :precondition (and (empty_crane ?c)
                       (handle ?c ?s)
		       (at ?x ?s)
		       (top ?x)
		       (on ?x ?y)
		       (at_dock ?x ?d)
		       (height ?s ?ch)
		       (prev_h ?nh ?ch))
    :effect (and (not (empty_crane ?c))
                 (hold ?c ?x)
		 (not (on ?x ?y))
		 (not (at ?x ?s))
		 (not (top ?x))
		 (not (available ?x))
		 (top ?y)
		 (not (at_dock ?x ?d))
		 (not (height ?s ?ch))
		 (height ?s ?nh))
  )

  (:action pick-from-stack-ob
    :parameters (?x - o_block ?y - (either block bottom) ?s - stack ?c - crane ?d - dock ?ch - height ?nh - height)
    :precondition (and (empty_crane ?c)
                       (handle ?c ?s)
		       (at ?x ?s)
		       (top ?x)
		       (on ?x ?y)
		       (at_dock ?x ?d)
		       (height ?s ?ch)
		       (prev_h ?nh ?ch))
    :effect (and (not (empty_crane ?c))
                 (hold ?c ?x)
		 (not (on ?x ?y))
		 (not (at ?x ?s))
		 (not (top ?x))
		 (not (available ?x))
		 (top ?y)
		 (not (at_dock ?x ?d))
                 (not (height ?s ?ch))
		 (height ?s ?nh))
  )

  (:action pick-from-stack-bo
    :parameters (?x - block ?y - o_block ?s - stack ?c - crane ?d - dock ?ch - height ?nh - height)
    :precondition (and (empty_crane ?c)
                       (handle ?c ?s)
		       (at ?x ?s)
		       (top ?x)
		       (on ?x ?y)
		       (at_dock ?x ?d)
		       (height ?s ?ch)
		       (prev_h ?nh ?ch))
    :effect (and (not (empty_crane ?c))
                 (hold ?c ?x)
		 (not (on ?x ?y))
		 (not (at ?x ?s))
		 (not (top ?x))
		 (top ?y)
		 (not (at_dock ?x ?d))
		 (available ?y)
                 (not (height ?s ?ch))
		 (height ?s ?nh))
  )


  (:action put-on-stack-bb
    :parameters (?x - block ?y - (either block bottom) ?s - stack ?c - crane ?d - dock ?ch - height ?nh - height ?mh - height)
    :precondition (and (hold ?c ?x)
                       (handle ?c ?s)
    		       (top ?y)
		       (at ?y ?s)
		       (at_dock ?y ?d)
		       (height ?s ?ch)
		       (next_h ?nh ?ch)
		       (max_height ?mh)
		       (not (next_h ?nh ?mh)))
    :effect (and (empty_crane ?c)
                 (not (hold ?c ?x))
		 (on ?x ?y)
		 (at ?x ?s)
		 (top ?x)
		 (not (top ?y))
		 (at_dock ?x ?d)
                 (not (height ?s ?ch))
		 (height ?s ?nh))
  )

  (:action put-on-stack-oo
    :parameters (?x - o_block ?y - o_block ?s - stack ?c - crane ?d - dock ?ch - height ?nh - height ?mh - height)
    :precondition (and (hold ?c ?x)
                       (handle ?c ?s)
    		       (top ?y)
		       (at ?y ?s)
		       (at_dock ?y ?d)
		       (height ?s ?ch)
		       (next_h ?nh ?ch)
		       (max_height ?mh)
		       (not (next_h ?nh ?mh)))
    :effect (and (empty_crane ?c)
                 (not (hold ?c ?x))
		 (on ?x ?y)
		 (at ?x ?s)
		 (top ?x)
		 (not (top ?y))
		 (at_dock ?x ?d)
		 (available ?x)
                 (not (height ?s ?ch))
		 (height ?s ?nh))
  )



  (:action put-on-stack-ob
    :parameters (?x - o_block ?y - (either block bottom) ?s - stack ?c - crane ?d - dock ?ch - height ?nh - height ?mh - height)
    :precondition (and (hold ?c ?x)
                       (handle ?c ?s)
    		       (top ?y)
		       (at ?y ?s)
		       (at_dock ?y ?d)
		       (height ?s ?ch)
		       (next_h ?nh ?ch)
		       (max_height ?mh)
		       (not (next_h ?nh ?mh)))
    :effect (and (empty_crane ?c)
                 (not (hold ?c ?x))
		 (on ?x ?y)
		 (at ?x ?s)
		 (top ?x)
		 (not (top ?y))
		 (at_dock ?x ?d)
		 (available ?x)
                 (not (height ?s ?ch))
		 (height ?s ?nh))
  )


 (:action put-on-stack-bo
    :parameters (?x - block ?y - o_block ?s - stack ?c - crane ?d - dock ?ch - height ?nh - height ?mh - height)
    :precondition (and (hold ?c ?x)
                       (handle ?c ?s)
    		       (top ?y)
		       (at ?y ?s)
		       (at_dock ?y ?d)
		       (height ?s ?ch)
		       (next_h ?nh ?ch)
		       (max_height ?mh)
		       (not (next_h ?nh ?mh)))
    :effect (and (empty_crane ?c)
                 (not (hold ?c ?x))
		 (on ?x ?y)
		 (at ?x ?s)
		 (top ?x)
		 (not (top ?y))
		 (at_dock ?x ?d)
		 (not (available ?y))
                 (not (height ?s ?ch))
		 (height ?s ?nh))
  )


  (:action pick-from-tape
    :parameters (?x - (either block o_block) ?c - crane ?t - tape)
    :precondition (and (block_in_tape ?x ?t)
                       (empty_crane ?c)
		       (handle ?c ?t))
		       
    :effect (and (not (block_in_tape ?x ?t)) (not (empty_crane ?c))
                 (empty_tape ?t) (hold ?c ?x))
  )
  (:action put-on-tape
    :parameters (?x - (either block o_block) ?c - crane ?t - tape)
    :precondition (and (empty_tape ?t)
                       (hold ?c ?x)
		       (handle ?c ?t))
		       
    :effect (and (block_in_tape ?x ?t) (empty_crane ?c)
                 (not (empty_tape ?t)) (not (hold ?c ?x)))
  )
)

; problem
(define (problem HARBOR_P04_V04)
(:domain HARBOR_V04)
(:objects C1 C2 - crane 
	  T1 - tape
	  B1 B2 B5 B6 B8 B9 B10 - block B3 B4 B7 - o_block
          S1 S2 S3 S4 S5 S6 - stack 
	  BOT1 BOT2 BOT3 BOT4 BOT5 BOT6 - bottom D1 D2 - dock
	  H0 H1 H2 H3 H4 - height)
(:init 
       (MAX_HEIGHT H2)
       (NEXT_H H1 H0)
       (NEXT_H H2 H1)
       (NEXT_H H3 H2)
       (NEXT_H H4 H3)
       (PREV_H H0 H1)
       (PREV_H H1 H2)
       (PREV_H H2 H3)
       (PREV_H H3 H4)
       (EMPTY_CRANE C1)
       (EMPTY_CRANE C2)
       (EMPTY_TAPE T1)
       (AT BOT1 S1)
       (AT BOT2 S2)
       (AT BOT3 S3)
       (AT BOT4 S4)
       (AT BOT5 S5)
       (AT BOT6 S6)
       (AT_DOCK BOT1 D1)
       (AT_DOCK BOT2 D1)
       (AT_DOCK BOT3 D1)
       (AT_DOCK BOT4 D2)
       (AT_DOCK BOT5 D2)
       (AT_DOCK BOT6 D2)
       (HANDLE C1 S1)
       (HANDLE C1 S2)
       (HANDLE C1 S3)
       (HANDLE C1 T1)
       (HANDLE C2 S4)
       (HANDLE C2 S5)
       (HANDLE C2 S6)
       (HANDLE C2 T1)
       (HEIGHT S1 H2)
       (HEIGHT S2 H2)
       (HEIGHT S3 H1)
       (HEIGHT S4 H2)
       (HEIGHT S5 H2)
       (HEIGHT S6 H1)

       (ON B1 BOT1)
       (AT B1 S1)
       (AT_DOCK B1 D1)

       (ON B2 BOT3)
       (AT B2 S3)
       (TOP B2)
       (AT_DOCK B2 D1)

       (ON B3 B5)
       (AT B3 S5)
       (AT_DOCK B3 D2)
       (TOP B3)
       (AVAILABLE B3)

       (ON B4 BOT4)
       (AT B4 S4)
       (AT_DOCK B4 D2)

       (ON B5 BOT5)
       (AT B5 S5)
       (AT_DOCK B5 D2)

       (ON B6 BOT6)
       (AT B6 S6)
       (TOP B6)
       (AT_DOCK B6 D2)

       (ON B7 B1)
       (AT B7 S1)
       (TOP B7)
       (AT_DOCK B7 D1)
       (AVAILABLE B7)

       (ON B8 B4)
       (AT B8 S4)
       (TOP B8)
       (AT_DOCK B8 D2)

       (ON B9 BOT2)
       (AT B9 S2)
       (AT_DOCK B9 D1)

       (ON B10 B9)
       (AT B10 S2)
       (TOP B10)
       (AT_DOCK B10 D1)
)

(:goal (and (AVAILABLE B7) (AVAILABLE B3) (AVAILABLE B4) (AT_DOCK B3 D1) (AT_DOCK B4 D1) (AT_DOCK B7 D1))))

; plan
1. (pick-from-stack-ob b3 b5 s5 c2 d2 h2 h1)
   deleted: (empty_crane c2) (on b3 b5) (at b3 s5) (top b3) (available b3) (at_dock b3 d2) (height s5 h2)
   added: (hold c2 b3) (top b5) (height s5 h1)
   goals met: 2 of 6
2. (put-on-tape b3 c2 t1)
   deleted: (empty_tape t1) (hold c2 b3)
   added: (block_in_tape b3 t1) (empty_crane c2)
   goals met: 2 of 6
3. (pick-from-tape b3 c1 t1)
   deleted: (block_in_tape b3 t1) (empty_crane c1)
   added: (empty_tape t1) (hold c1 b3)
   goals met: 2 of 6
4. (put-on-stack-ob b3 b2 s3 c1 d1 h1 h2 h2)
   deleted: (hold c1 b3) (top b2) (height s3 h1)
   added: (empty_crane c1) (on b3 b2) (at b3 s3) (top b3) (at_dock b3 d1) (available b3) (height s3 h2)
   goals met: 4 of 6
5. (pick-from-stack-bb b10 b9 s2 c1 d1 h2 h1)
   deleted: (empty_crane c1) (on b10 b9) (at b10 s2) (top b10) (at_dock b10 d1) (height s2 h2)
   added: (hold c1 b10) (top b9) (height s2 h1)
   goals met: 4 of 6
6. (put-on-tape b10 c1 t1)
   deleted: (empty_tape t1) (hold c1 b10)
   added: (block_in_tape b10 t1) (empty_crane c1)
   goals met: 4 of 6
7. (pick-from-stack-bo b8 b4 s4 c2 d2 h2 h1)
   deleted: (empty_crane c2) (on b8 b4) (at b8 s4) (top b8) (at_dock b8 d2) (height s4 h2)
   added: (hold c2 b8) (top b4) (available b4) (height s4 h1)
   goals met: 5 of 6
8. (put-on-stack-bb b8 b5 s5 c2 d2 h1 h2 h2)
   deleted: (hold c2 b8) (top b5) (height s5 h1)
   added: (empty_crane c2) (on b8 b5) (at b8 s5) (top b8) (at_dock b8 d2) (height s5 h2)
   goals met: 5 of 6
9. (pick-from-tape b10 c2 t1)
   deleted: (block_in_tape b10 t1) (empty_crane c2)
   added: (empty_tape t1) (hold c2 b10)
   goals met: 5 of 6
10. (put-on-stack-bb b10 b6 s6 c2 d2 h1 h2 h2)
   deleted: (hold c2 b10) (top b6) (height s6 h1)
   added: (empty_crane c2) (on b10 b6) (at b10 s6) (top b10) (at_dock b10 d2) (height s6 h2)
   goals met: 5 of 6
11. (pick-from-stack-ob b4 bot4 s4 c2 d2 h1 h0)
   deleted: (empty_crane c2) (on b4 bot4) (at b4 s4) (top b4) (available b4) (at_dock b4 d2) (height s4 h1)
   added: (hold c2 b4) (top bot4) (height s4 h0)
   goals met: 4 of 6
12. (put-on-tape b4 c2 t1)
   deleted: (empty_tape t1) (hold c2 b4)
   added: (block_in_tape b4 t1) (empty_crane c2)
   goals met: 4 of 6
13. (pick-from-tape b4 c1 t1)
   deleted: (block_in_tape b4 t1) (empty_crane c1)
   added: (empty_tape t1) (hold c1 b4)
   goals met: 4 of 6
14. (put-on-stack-ob b4 b9 s2 c1 d1 h1 h2 h2)
   deleted: (hold c1 b4) (top b9) (height s2 h1)
   added: (empty_crane c1) (on b4 b9) (at b4 s2) (top b4) (at_dock b4 d1) (available b4) (height s2 h2)
   goals met: 6 of 6
